

from AMBOTMusicBoT import BOT_NAME

PM_START_TEXT = """
нєу {0}, 
       ᴛʜɪs ɪs {1} !
       
⚡️ғᴇᴀᴛᴜʀᴇs ⚡️
➻ ɪ ᴄᴀɴ ᴘʟᴀʏ ꜱᴏɴɢ ɪɴ ɢʀᴏᴜᴘ ᴠᴄ.
➻ ɴᴏ ʟᴀɢ.
➻ ᴅᴏᴡɴʟᴏᴀᴅ ꜱᴏɴɢ.
➻ ɴᴏ ᴘʀᴏᴍᴏ.
➻ ʙᴇꜱᴛ ꜱᴏᴜɴᴅ Qᴜᴀʟɪᴛʏ.
➻ ᴘʟᴀʏɪɴɢ ᴀᴜᴅɪᴏ ᴍᴜꜱɪᴄ ᴀɴᴅ ᴠɪᴅᴇᴏ ᴄᴏɴᴛᴇɴᴛ ɪɴ ɢʀᴏᴜᴘꜱ.
➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʜᴇʟᴩ ʙᴜᴛᴛᴏɴ ᴛᴏ ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴍʏ ᴍᴏᴅᴜʟᴇs ᴀɴᴅ ᴄᴏᴍᴍᴀɴᴅs.
 """

START_TEXT = """
нєу {0}, 🥀
  {1} ɴᴏᴡ ᴜ ᴄᴀɴ ᴘʟᴀʏ ᴀ ᴍᴜꜱɪᴄ ɪɴ {2}.

──────────────────
➻ ɪ ᴜ ᴡᴀɴᴛ ʜᴇʟᴘ ᴀʙᴏᴜᴛ ᴛʜɪꜱ ʙᴏᴛ ᴊᴏɪɴ ᴏᴜʀ ꜱᴜᴘᴘᴏʀᴛ [ɢʀᴏᴜᴘ](https://t.me/TeamSuperBan)
"""

HELP_TEXT = f"""
<u> ᴄᴍᴅꜱ ꜰᴏʀ ᴜꜱᴇʀꜱ ɪɴ {BOT_NAME} :</u>

❏ /play : 𝙎𝙩𝙖𝙧𝙩𝙨 𝙎𝙩𝙧𝙚𝙖𝙢𝙞𝙣𝙜 𝙏𝙝𝙚 𝙍𝙚𝙦𝙪𝙚𝙨𝙩𝙚𝙙 𝙏𝙧𝙖𝙘𝙠 𝙊𝙣 𝙑𝙞𝙙𝙚𝙤𝘾𝙝𝙖𝙩.
❏ /pause : 𝙋𝙖𝙪𝙨𝙚 𝙩𝙝𝙚 𝘾𝙪𝙧𝙧𝙚𝙣𝙩 𝙋𝙡𝙖𝙮𝙞𝙣𝙜 𝙎𝙩𝙧𝙚𝙖𝙢.
❏ /resume : 𝙍𝙚𝙨𝙪𝙢𝙚 𝙩𝙝𝙚 𝙋𝙖𝙪𝙨𝙚𝙙 𝙨𝙩𝙧𝙚𝙖𝙢.
❏ /skip : 𝙎𝙠𝙞𝙥 𝙩𝙝𝙚 𝘾𝙪𝙧𝙧𝙚𝙣𝙩 𝙋𝙡𝙖𝙮𝙞𝙣𝙜 𝙎𝙩𝙧𝙚𝙖𝙢 𝘼𝙣𝙙 𝙎𝙩𝙖𝙧𝙩 𝙎𝙩𝙧𝙚𝙖𝙢𝙞𝙣𝙜 𝙏𝙝𝙚 𝙉𝙚𝙭𝙩 𝙏𝙧𝙖𝙘𝙠 𝙄𝙣 𝙌𝙪𝙚𝙪𝙚.
❏ /end : 𝘾𝙡𝙚𝙖𝙧𝙨 𝙩𝙝𝙚 𝙌𝙪𝙚𝙪𝙚 𝘼𝙣𝙙 𝙏𝙝𝙚 𝘾𝙪𝙧𝙧𝙚𝙣𝙩 𝙋𝙡𝙖𝙮𝙞𝙣𝙜 𝙎𝙩𝙧𝙚𝙖𝙢.

❏ /ping : 𝙎𝙝𝙤𝙬 𝙩𝙝𝙚 𝙋𝙞𝙣𝙜 𝘼𝙣𝙙 𝙎𝙮𝙨𝙩𝙚𝙢 𝙎𝙩𝙖𝙩𝙨 𝙤𝙛 𝙏𝙝𝙚 𝘽𝙤𝙩.
❏ /sudolist : 𝙎𝙝𝙤𝙬𝙨 𝙩𝙝𝙚 𝙇𝙞𝙨𝙩 𝙤𝙛 𝙎𝙪𝙙𝙤 𝙐𝙨𝙚𝙧𝙨 𝙊𝙛 𝙩𝙝𝙚 𝘽𝙤𝙩.

❏ /song : 𝘿𝙤𝙬𝙣𝙡𝙤𝙖𝙙𝙨 𝙩𝙝𝙚 𝙍𝙚𝙦𝙪𝙚𝙨𝙩𝙚𝙙 𝙎𝙤𝙣𝙜 𝘼𝙣𝙙 𝙎𝙚𝙣𝙙 𝙞𝙩 𝙏𝙤 𝙮𝙤𝙪 

❏ /search : 𝙎𝙚𝙖𝙧𝙘𝙝 𝙩𝙝𝙚 𝙂𝙞𝙫𝙚𝙣 𝙌𝙪𝙚𝙧𝙮 𝙊𝙣 𝙔𝙤𝙪𝙏𝙪𝙗𝙚 𝙖𝙣𝙙 𝙎𝙝𝙤𝙬 𝙮𝙤𝙪 𝙏𝙝𝙚 𝙍𝙚𝙨𝙪𝙡𝙩𝙨 
"""

HELP_SUDO = f"""
<u> ꜱᴜᴅᴏ ᴜꜱᴇʀꜱ ᴄᴏᴍᴍᴀɴᴅꜱ ɪɴ {BOT_NAME} :</u>

❏ /activevc : 𝙎𝙝𝙤𝙬𝙨 𝙩𝙝𝙚 𝙇𝙞𝙨𝙩 𝙤𝙛 𝘾𝙪𝙧𝙧𝙚𝙣𝙩𝙡𝙮 𝘼𝙘𝙩𝙞𝙫𝙚 𝙑𝙤𝙞𝙘𝙚 𝙘𝙝𝙖𝙩. 𝙎𝙝𝙤𝙬𝙨 𝙩𝙝𝙚 𝙇𝙞𝙨𝙩 𝙤𝙛 𝘾𝙪𝙧𝙧𝙚𝙣𝙩𝙡𝙮.
❏ /eval or /sh : 𝙍𝙪𝙣𝙨 𝙩𝙝𝙚 𝙂𝙞𝙫𝙚𝙣 𝘾𝙤𝙙𝙚 𝙊𝙣 𝙩𝙝𝙚 𝘽𝙤𝙩'𝙨 𝙏𝙚𝙧𝙢𝙞𝙣𝙖𝙡
❏ /speedtest : 𝙍𝙪𝙣𝙨 𝘼 𝙎𝙥𝙚𝙚𝙙𝙏𝙚𝙨𝙩 𝙊𝙣 𝙩𝙝𝙚 𝘽𝙤𝙩'𝙨 𝙎𝙚𝙧𝙫𝙚𝙧.
❏ /sysstats : 𝙎𝙝𝙤𝙬𝙨 𝙏𝙝𝙚 𝙎𝙮𝙨𝙩𝙚𝙢 𝙎𝙩𝙖𝙩𝙨 𝙊𝙛 𝙩𝙝𝙚 𝘽𝙤𝙩'𝙨.
  

❏ /assname : [𝙏𝙚𝙭𝙩 𝙊𝙧 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝙖 𝙩𝙚𝙭𝙩] : 𝘾𝙝𝙖𝙣𝙜𝙚 𝙩𝙝𝙚 𝘼𝙨𝙨𝙞𝙨𝙩𝙖𝙣𝙩 𝘼𝙘𝙘𝙤𝙪𝙣𝙩 𝙉𝙖𝙢𝙚. 
❏ /assbio : [𝙏𝙚𝙭𝙩 𝙊𝙧 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝙖 𝙩𝙚𝙭𝙩] : 𝘾𝙝𝙖𝙣𝙜𝙚 𝙩𝙝𝙚 𝘽𝙞𝙤 𝙤𝙛 𝙏𝙝𝙚 𝘼𝙨𝙨𝙞𝙨𝙩𝙖𝙣𝙩 𝘼𝙘𝙘𝙤𝙪𝙣𝙩.
❏ /asspfp [𝙍𝙚𝙥𝙡𝙮 𝙩𝙤 𝙖 𝙋𝙝𝙤𝙩𝙤 ] : 𝘾𝙝𝙖𝙣𝙜𝙚 𝙩𝙝𝙚 𝙋𝙛𝙋 𝙤𝙛 𝙩𝙝𝙚 𝘼𝙨𝙨𝙞𝙨𝙩𝙖𝙣𝙩 𝘼𝙘𝙘𝙤𝙪𝙣𝙩.
 
❏ /delpfp : 𝘿𝙚𝙡𝙚𝙩𝙚 𝙩𝙝𝙚 𝘾𝙪𝙧𝙧𝙚𝙣𝙩 𝙋𝙛𝙋 𝙤𝙛 𝙏𝙝𝙚 𝘼𝙨𝙨𝙞𝙨𝙩𝙖𝙣𝙩 𝘼𝙘𝙘𝙤𝙪𝙣𝙩.
"""

HELP_DEV = f"""
<u>ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ ɪɴ {BOT_NAME} :</u>

❏ /config : 𝙏𝙤 𝙜𝙚𝙩 𝘼𝙡𝙡 𝘾𝙤𝙣𝙛𝙞𝙜 𝙑𝙖𝙧𝙞𝙖𝙗𝙡𝙚𝙨 𝙊𝙧 𝘽𝙤𝙩.
❏ /broadcast : [𝙈𝙚𝙨𝙨𝙖𝙜𝙚 𝙤𝙛 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝙖 𝙈𝙖𝙨𝙨𝙖𝙜𝙚] : 𝘽𝙧𝙤𝙖𝙙𝙘𝙖𝙨𝙩 𝙩𝙝𝙚 𝙈𝙖𝙨𝙨𝙖𝙜𝙚 𝙏𝙤 𝙎𝙚𝙧𝙫𝙚𝙙 𝘾𝙝𝙖𝙩𝙨 𝙊𝙛 𝙏𝙝𝙚 𝘽𝙤𝙩𝙨.
❏ /rmdownloads : 𝘾𝙡𝙚𝙖𝙧𝙨 𝙩𝙝𝙚 𝘾𝙖𝙘𝙝𝙚 𝙁𝙞𝙡𝙚𝙨 𝘿𝙤𝙬𝙣𝙡𝙤𝙖𝙙 𝙊𝙣 𝙩𝙝𝙚 𝘽𝙤𝙩'𝙨 𝙎𝙚𝙧𝙫𝙚𝙧.
❏ /leaveall : 𝙊𝙧𝙙𝙚𝙧𝙨 𝙩𝙝𝙚 𝘼𝙨𝙨𝙞𝙨𝙩𝙖𝙣𝙩 𝘼𝙘𝙘𝙤𝙪𝙣𝙩 𝙏𝙤 𝙇𝙚𝙖𝙫𝙚 𝘼𝙡𝙡 𝘾𝙝𝙖𝙩𝙨.
❏ /addsudo : [𝙐𝙨𝙚𝙧𝙣𝙖𝙢𝙚 𝙤𝙧 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝘼 𝙐𝙨𝙚𝙧] : 𝘼𝙙𝙙 𝙏𝙝𝙚 𝙐𝙨𝙚𝙧 𝙩𝙤 𝙎𝙪𝙙𝙤 𝙐𝙨𝙚𝙧𝙨 𝙇𝙞𝙨𝙩.
❏ /rmsudo : [𝙐𝙨𝙚𝙧𝙣𝙖𝙢𝙚 𝙤𝙧 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝘼 𝙐𝙨𝙚𝙧] : 𝙍𝙚𝙢𝙤𝙫𝙚 𝙩𝙝𝙚 𝙐𝙨𝙚𝙧 𝙁𝙧𝙤𝙢 𝙎𝙪𝙙𝙤 𝙐𝙨𝙚𝙧𝙨 𝙇𝙞𝙨𝙩.
"""
COPY_DEV = f"""
<u>ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅꜱ ɪɴ {BOT_NAME} :</u>

❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /report ᴄᴏᴘʏʀɪɢʜᴛ ꜰʀᴏᴍ ᴍᴇꜱꜱᴇɢᴇꜱ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /reportpfd ᴄᴏᴘʏʀɪɢʜᴛ ꜰʀᴏᴍ ꜰɪʟᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /leave ɢɪᴠᴇ ᴍᴇ ᴜꜱᴇʀɴᴀᴍᴇ ᴡʜɪᴄʜ ɢʀᴏᴜᴘ ꜰʀᴏᴍ ʟᴇᴀᴠᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /setpfp ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /delpfp ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /setbio ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /setname ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /leaveall1 ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /leaveall2 ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /leaveallch1 ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
❏ ᴊᴜꜱᴛ ꜱᴇɴᴅ ᴜꜱᴇ ꜰᴏʀᴍᴀᴛ ʟɪᴋᴇ : /leaveallch2 ᴀʙ ᴋʏᴀ ʟɪᴋʜᴜ ᴍᴇ.
"""
